# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd 
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [1]:
data_url = r"https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"

### Step 3. Assign it to a variable called baby_names.

In [ ]:
# You Can Also Read Data From The Link
# baby_names = pd.read_csv(data_url)

In [9]:
baby_names = pd.read_csv("US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [10]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [11]:
baby_names.drop(columns=["Unnamed: 0", "Id"], inplace=True)

In [13]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [16]:
baby_names["Gender"].value_counts(normalize=1)*100

F    54.983151
M    45.016849
Name: Gender, dtype: float64

### Step 7. Group the dataset by name and assign to names

In [73]:
# Get The occurrences For Eahc Name
names = baby_names.groupby("Name")["Count"].sum().sort_values(ascending=False)
names.head(10)

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
William     197894
Joshua      191551
Sophia      191446
Daniel      191440
Emily       190318
Name: Count, dtype: int64

### Step 8. How many different names exist in the dataset?

In [70]:
baby_names["Name"].nunique()

17632

### Step 9. What is the name with most occurrences?

In [71]:
# Get names From Groupped in Step. 7
names.head(1)

Name
Jacob    242874
Name: Count, dtype: int64

### Step 10. How many different names have the least occurrences?

In [79]:
# Get names From Groupped in Step. 7
len(names[names == names.min()])

2578

In [78]:
# Anotger Way To Do This
(names == names.min()).sum()

2578

### Step 11. What is the median name occurrence?

In [68]:
mask = (names == names.median())
names[mask].sort_index()

Name
Aishani    49
Alara      49
Alysse     49
Ameir      49
Anely      49
           ..
Sriram     49
Trinton    49
Vita       49
Yoni       49
Zuleima    49
Name: Count, Length: 66, dtype: int64

### Step 12. What is the standard deviation of names?

In [80]:
round(names.std(), 4)

11006.0695

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [90]:
names.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64